muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
  float wx = fx - (float)sx0;
  float wy = fy - (float)sy0;

  const int idx00 = (csy0 * src_w + csx0) * 3;
  const int idx01 = (csy0 * src_w + csx1) * 3;
  const int idx10 = (csy1 * src_w + csx0) * 3;
  const int idx11 = (csy1 * src_w + csx1) * 3;

  const float w00 = (1.0f - wx) * (1.0f - wy);
  const float w01 = (       wx) * (1.0f - wy);
  const float w10 = (1.0f - wx) * (       wy);
  const float w11 = (       wx) * (       wy);

  *r = src_nhwc[idx00+0]*w00 + src_nhwc[idx01+0]*w01 +
       src_nhwc[idx10+0]*w10 + src_nhwc[idx11+0]*w11;
  *g = src_nhwc[idx00+1]*w00 + src_nhwc[idx01+1]*w01 +
       src_nhwc[idx10+1]*w10 + src_nhwc[idx11+1]*w11;
  *b = src_nhwc[idx00+2]*w00 + src_nhwc[idx01+2]*w01 +
       src_nhwc[idx10+2]*w10 + src_nhwc[idx11+2]*w11;

  if (hit_border) {
    int clamped = (csx0 != sx0) || (csx1 != sx1) || (csy0 != sy0) || (csy1 != sy1);
    *hit_border = clamped;
  }
}

/* Crop detector float32 frame (RGB, NHWC, [0..1]) using ROI
 * → FaceRec 160×160 quantized input (INT8 sym or U8 asym), with margin.
 * Matches TFLite U8 input quantization: scale=1/128, zp=127 when FR_INPUT_IS_U8=1.
 * Optional brightness normalization can be enabled with FR_ENABLE_BRIGHTEN (two-pass).
 */
static void crop_to_facerec_input_quant_from_detector_f32(
    const float *src_nhwc,  int src_w, int src_h,
    const od_pp_outBuffer_t *roi,
    float margin,           /* e.g. 0.20f = +20% */
#if FR_INPUT_IS_U8
    uint8_t *dst,
#else
    int8_t  *dst,
#endif
    int dst_w, int dst_h,
    CropDbg *dbg /* optional */)
{
  /* square crop with configurable margin */
  const float cx = roi->x_center * (float)src_w;
  const float cy = roi->y_center * (float)src_h;
  const float bw = roi->width  * (float)src_w;
  const float bh = roi->height * (float)src_h;
  const float side0 = fmaxf(bw, bh);
  const float side  = side0 * (1.0f + margin);
  const float x0 = cx - side * 0.5f;
  const float y0 = cy - side * 0.5f;
  const float x1 = cx + side * 0.5f;
  const float y1 = cy + side * 0.5f;

  const float sx_scale = (x1 - x0) / (float)dst_w;
  const float sy_scale = (y1 - y0) / (float)dst_h;

  int taps = 0, clamped = 0;
  double acc_r = 0.0, acc_g = 0.0, acc_b = 0.0;

#if FR_ENABLE_BRIGHTEN
  /* ----- Pass 1: estimate mean brightness in the crop ----- */
  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      float r,g,b; int hit=0;
      bilinear_rgb_sample(src_nhwc, src_w, src_h, sx, sy, &r, &g, &b, &hit);
      acc_r += r; acc_g += g; acc_b += b;
      taps++; if (hit) clamped++;
    }
  }
  double denom = (double)(dst_w * dst_h);
  float mean_r = (float)(acc_r / denom);
  float mean_g = (float)(acc_g / denom);
  float mean_b = (float)(acc_b / denom);
  float mean_rgb = (mean_r + mean_g + mean_b) * (1.0f/3.0f);

  float gain = 1.0f;
  if (mean_rgb > 1e-6f) {
    gain = clampf(FR_BRIGHTEN_TARGET / mean_rgb, FR_BRIGHTEN_GAIN_MIN, FR_BRIGHTEN_GAIN_MAX);
  }
  /* reset accumulators if dbg requested (so they reflect post-gain means) */
  if (dbg) { acc_r = acc_g = acc_b = 0.0; taps = 0; clamped = 0; }

  /* ----- Pass 2: apply gain, map to [-1,1], then quantize ----- */
  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      float r,g,b; int hit=0;
      bilinear_rgb_sample(src_nhwc, src_w, src_h, sx, sy, &r, &g, &b, &hit);
      r = clampf(r*gain, 0.0f, 1.0f);
      g = clampf(g*gain, 0.0f, 1.0f);
      b = clampf(b*gain, 0.0f, 1.0f);

      if (dbg) { acc_r += r; acc_g += g; acc_b += b; taps++; if (hit) clamped++; }

      /* map [0..1] → [-1,1] */
      float rq = r * 2.0f - 1.0f;
      float gq = g * 2.0f - 1.0f;
      float bq = b * 2.0f - 1.0f;

      const int d = (y * dst_w + x) * 3;
  #if FR_INPUT_IS_U8
      int qr = (int)lrintf(rq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qg = (int)lrintf(gq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qb = (int)lrintf(bq * FR_IN_INV_SCALE + FR_IN_ZP);
      if (qr < 0)   qr = 0;   else if (qr > 255) qr = 255;
      if (qg < 0)   qg = 0;   else if (qg > 255) qg = 255;
      if (qb < 0)   qb = 0;   else if (qb > 255) qb = 255;
      ((uint8_t*)dst)[d+0] = (uint8_t)qr;
      ((uint8_t*)dst)[d+1] = (uint8_t)qg;
      ((uint8_t*)dst)[d+2] = (uint8_t)qb;
  #else
      int qr = (int)lrintf(rq * 127.0f);
      int qg = (int)lrintf(gq * 127.0f);
      int qb = (int)lrintf(bq * 127.0f);
      if (qr < -128) qr = -128; else if (qr > 127) qr = 127;
      if (qg < -128) qg = -128; else if (qg > 127) qg = 127;
      if (qb < -128) qb = -128; else if (qb > 127) qb = 127;
      ((int8_t*)dst)[d+0] = (int8_t)qr;
      ((int8_t*)dst)[d+1] = (int8_t)qg;
      ((int8_t*)dst)[d+2] = (int8_t)qb;
  #endif
    }
  }

#else  /* FR_ENABLE_BRIGHTEN == 0 : single-pass, no gain */

  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      float r,g,b; int hit=0;
      bilinear_rgb_sample(src_nhwc, src_w, src_h, sx, sy, &r, &g, &b, &hit);

      acc_r += r; acc_g += g; acc_b += b;
      taps++; if (hit) clamped++;

      /* map [0..1] → [-1,1] */
      float rq = r * 2.0f - 1.0f;
      float gq = g * 2.0f - 1.0f;
      float bq = b * 2.0f - 1.0f;

      const int d = (y * dst_w + x) * 3;

  #if FR_INPUT_IS_U8
      int qr = (int)lrintf(rq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qg = (int)lrintf(gq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qb = (int)lrintf(bq * FR_IN_INV_SCALE + FR_IN_ZP);
      if (qr < 0)   qr = 0;   else if (qr > 255) qr = 255;
      if (qg < 0)   qg = 0;   else if (qg > 255) qg = 255;
      if (qb < 0)   qb = 0;   else if (qb > 255) qb = 255;
      ((uint8_t*)dst)[d+0] = (uint8_t)qr;
      ((uint8_t*)dst)[d+1] = (uint8_t)qg;
      ((uint8_t*)dst)[d+2] = (uint8_t)qb;
  #else
      int qr = (int)lrintf(rq * 127.0f);
      int qg = (int)lrintf(gq * 127.0f);
      int qb = (int)lrintf(bq * 127.0f);
      if (qr < -128) qr = -128; else if (qr > 127) qr = 127;
      if (qg < -128) qg = -128; else if (qg > 127) qg = 127;
      if (qb < -128) qb = -128; else if (qb > 127) qb = 127;
      ((int8_t*)dst)[d+0] = (int8_t)qr;
      ((int8_t*)dst)[d+1] = (int8_t)qg;
      ((int8_t*)dst)[d+2] = (int8_t)qb;
  #endif
    }
  }

#endif /* FR_ENABLE_BRIGHTEN */

  if (dbg) {
    dbg->x0 = x0; dbg->y0 = y0; dbg->x1 = x1; dbg->y1 = y1;
    dbg->side = side; dbg->roi_w = bw; dbg->roi_h = bh;
    dbg->taps = taps; dbg->taps_clamped = clamped;
    double denom2 = (double)(dst_w * dst_h);
    dbg->mean_r = (float)(acc_r / denom2);
    dbg->mean_g = (float)(acc_g / denom2);
    dbg->mean_b = (float)(acc_b / denom2);
  }
}

