muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
/* Quick utility */
static float l2_norm(const float *x, int n)
{
  double s=0.0; for (int i=0;i<n;i++){ double v=x[i]; s+=v*v; }
  return (float)sqrt(s);
}

void pp_thread_fct(void *arg)
{
#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UF
  yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UF || POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  /* BlazeFace: no static params */
#else
# error "PostProcessing type not supported"
#endif

  const LL_Buffer_InfoTypeDef *nn_out_info = Detector_Out_Info();

  /* Log detector outputs layout once (sanity check) */
  {
    for (int i = 0; i < NN_OUT_NB; ++i) {
      const char *nm = nn_out_info[i].name ? nn_out_info[i].name : "(null)";
      unsigned long blen = (unsigned long)LL_Buffer_len(&nn_out_info[i]);
      printf("[NN] out[%d] %-24s len=%lu bytes (%lu floats)\r\n",
             i, nm, blen, blen / (unsigned long)sizeof(float));
    }
  }

  void *pp_input[NN_OUT_NB];
  uint32_t pp_len[NN_OUT_NB];
  od_pp_out_t pp_output;
  uint32_t nn_pp[2];
  int ret;

#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  app_postprocess_init(NULL);
#else
  app_postprocess_init(&pp_params);
#endif

  /* -------- FaceRec I/O discovery (INT8 pipeline) -------- */
  const LL_Buffer_InfoTypeDef *fr_in_info  = LL_ATON_Input_Buffers_Info_face_recognition();
  const LL_Buffer_InfoTypeDef *fr_out_info = LL_ATON_Output_Buffers_Info_face_recognition();

#if FR_INPUT_IS_U8
  uint8_t *fr_in = (uint8_t *)LL_Buffer_addr_start(&fr_in_info[0]);    /* U8 input */
  const char *mode_str = "U8(zp=127)";
#else
  int8_t  *fr_in = (int8_t  *)LL_Buffer_addr_start(&fr_in_info[0]);    /* I8 input */
  const char *mode_str = "I8(zp=0)";
#endif
  int8_t  *fr_out       = (int8_t  *)LL_Buffer_addr_start(&fr_out_info[0]); /* I8 output */
  uint32_t fr_in_len    = LL_Buffer_len(&fr_in_info[0]);
  uint32_t fr_out_len   = LL_Buffer_len(&fr_out_info[0]);

  const uint32_t need_in_bytes = (uint32_t)(FR_IN_W * FR_IN_H * 3);  /* e.g., 160*160*3 = 76800 */

  if (!fr_in || !fr_out || fr_in_len < need_in_bytes || fr_out_len < FR_EMB_SIZE) {
    printf("[FR][ERR] IO invalid: in=%p (%lu) out=%p (%lu) need_in=%lu need_out=%u\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE);
  } else {
    printf("[FR][IO] IN=%p (%lu) OUT=%p (%lu)  (expected in=%lu out=%u)  [mode=%s]\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE, mode_str);
  }

  /* Audit reference set once */
#if DBG_AUDIT_REFSET
  {
    printf("[REFSET] entries=%d\r\n", g_ref_set_count);
    int bad=0;
    for (int i=0;i<g_ref_set_count;i++){
      float n = l2_norm(g_ref_set[i].data, g_ref_set[i].dim);
      printf("  - #%d name=%s dim=%d L2=%.3f\r\n", i,
             (g_ref_set[i].name?g_ref_set[i].name:"?"),
             g_ref_set[i].dim, n);
      if (!(n>0.0f && isfinite(n))) bad++;
    }
    if (bad) printf("[REFSET][WARN] %d invalid L2 norms (zero/NaN/Inf)\r\n", bad);
  }
#endif

  /* Simple stabilizer for a single primary box */
  typedef struct {
    od_pp_outBuffer_t roi;
    int   have;
    int   visible_count;
    int   missing_count;
    uint32_t last_seen_ms;
  } primary_t;
  static primary_t primary = {0};

  /* selection/stabilization knobs (local consts for clarity) */
  const float     ACCEPT_CONF_MIN  = FR_ACCEPT_CONF_MIN;
  const float     ACCEPT_SIDE_MIN  = FR_ACCEPT_SIDE_MIN;
  const float     CENTER_TOL       = FR_CENTER_TOL;
  const float     SCORE_SIDE_REF   = FR_SCORE_SIDE_REF;
  const float     STABLE_IOU_MIN   = FR_STABLE_IOU_MIN;
  const int       HOLD_MISS_FRAMES = FR_HOLD_MISS_FRAMES;
  const float     EMA_ALPHA        = FR_EMA_ALPHA;

  /* FR throttling & threshold */
  uint32_t last_fr_ms = 0;
  const uint32_t FR_PERIOD = FR_PERIOD_MS;
  const float    MATCH_THR = FR_MATCH_THR;

  /* Debug cadence */
  uint32_t last_dbg_ms = 0;

  /* Previous embedding for self-consistency */
  float prev_emb[FR_EMB_SIZE]; int have_prev = 0;

  while (1)
  {
    (void)bqueue_get_ready(&nn_output_queue);

    /* Map & invalidate NPU outputs for CPU read */
    for (int i = 0; i < NN_OUT_NB; i++) {
      pp_input[i] = LL_Buffer_addr_start(&nn_out_info[i]);
      pp_len[i]   = LL_Buffer_len(&nn_out_info[i]);
      DCACHE_Invalidate(pp_input[i], pp_len[i]);
    }

    /* Run detection postprocess */
    pp_output.pOutBuff  = NULL;
    pp_output.nb_detect = 0;
    nn_pp[0] = HAL_GetTick();
#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, NULL);
#else
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, &pp_params);
#endif
    assert(ret == 0);
    nn_pp[1] = HAL_GetTick();

    uint32_t now = nn_pp[1];

    /* -------- choose ONE best detection & stabilize -------- */
    od_pp_outBuffer_t best;
    int have_best = 0;
    if (pp_output.nb_detect > 0) {
      float best_score = -1.f;
      int best_i = -1;
      for (uint32_t i = 0; i < pp_output.nb_detect; ++i) {
        const od_pp_outBuffer_t *d = &pp_output.pOutBuff[i];
        float side = fmaxf(d->width, d->height);
        if (d->conf < ACCEPT_CONF_MIN || side < ACCEPT_SIDE_MIN) continue;

        float dx = fabsf(d->x_center - 0.5f);
        float dy = fabsf(d->y_center - 0.5f);
        float r_center = sqrtf(dx*dx + dy*dy);
        float s_size   = fminf(1.f, side / SCORE_SIDE_REF);
        float s_center = 1.f - fminf(1.f, r_center / CENTER_TOL);
        float score = d->conf * (0.25f + 0.75f * s_size) * s_center;

        if (score > best_score) { best_score = score; best = *d; have_best = 1; best_i = (int)i; }
      }
      if (have_best) {
#if DBG_PRINT_ROI
        float side = fmaxf(best.width, best.height);
        float dx = fabsf(best.x_center - 0.5f);
        float dy = fabsf(best.y_center - 0.5f);
        float r_center = sqrtf(dx*dx + dy*dy);
        printf("[PP] best_det idx=%d conf=%.2f side=%.3f r_center=%.3f\r\n", best_i, best.conf, side, r_center);
#endif
      }
    }

    if (have_best) {
      if (!primary.have) {
        primary.roi = best;
        primary.have = 1;
        primary.visible_count = 1;
        primary.missing_count = 0;
        primary.last_seen_ms  = now;
      } else {
        /* IoU vs previous → smooth if “same” */
        float ov = iou_norm_boxes(&primary.roi, &best);
        if (ov >= STABLE_IOU_MIN) {
          primary.roi.x_center = EMA_ALPHA*primary.roi.x_center + (1.f-EMA_ALPHA)*best.x_center;
          primary.roi.y_center = EMA_ALPHA*primary.roi.y_center + (1.f-EMA_ALPHA)*best.y_center;
          primary.roi.width    = EMA_ALPHA*primary.roi.width    + (1.f-EMA_ALPHA)*best.width;
          primary.roi.height   = EMA_ALPHA*primary.roi.height   + (1.f-EMA_ALPHA)*best.height;
          primary.roi.conf     = best.conf;
          primary.roi.class_index = best.class_index;
          primary.visible_count++;
          primary.missing_count = 0;
          primary.last_seen_ms  = now;
        } else {
          if (primary.missing_count >= HOLD_MISS_FRAMES) {
            primary.roi = best;
            primary.visible_count = 1;
            primary.missing_count = 0;
            primary.last_seen_ms  = now;
          } else {
            primary.missing_count++;
          }
        }
      }
    } else {
      if (primary.have) {
        primary.missing_count++;
        if (primary.missing_count > HOLD_MISS_FRAMES) {
          memset(&primary, 0, sizeof(primary));
          g_fr_overlay_label[0] = '\0';  /* clear overlay */
        }
      }
    }

    /* ---------- FaceRec match (throttled) ---------- */
    if (primary.have && fr_in && fr_out && (now - last_fr_ms >= FR_PERIOD)) {
      last_fr_ms = now;

      /* Always take a fresh, race-free detector snapshot **inside** the loop */
      const float *det_in = NULL;
      uint32_t det_in_len = 0;
      fr_get_frame_snapshot((const void **)&det_in, &det_in_len);
      if (!det_in || det_in_len < (NN_WIDTH * NN_HEIGHT * 3 * sizeof(float))) {
        printf("[FR][ERR] snapshot invalid (ptr=%p len=%lu)\r\n",
               (void*)det_in, (unsigned long)det_in_len);
        /* publish empty detection & move on */
        bqueue_put_free(&nn_output_queue);
        xSemaphoreGive(disp.update);
        continue;
      }

      CropDbg cdbg;
      /* Prepare FR input: detector float [0..1] -> FR quant (I8 or U8) with margin */
      crop_to_facerec_input_quant_from_detector_f32(
        det_in, NN_WIDTH, NN_HEIGHT,
        &primary.roi,
        FR_CROP_MARGIN,
        fr_in, FR_IN_W, FR_IN_H,
        &cdbg);

      /* Cache: CPU -> NPU */
      DCACHE_Clean(fr_in, need_in_bytes);

      /* Optional periodic debug on crop + input stats */
      if ((now - last_dbg_ms) >= DBG_EVERY_MS) {
#if DBG_PRINT_ROI
        printf("[FR][crop] px=[%.1f,%.1f]-[%.1f,%.1f] side=%.1f roiWH=%.1fx%.1f "
               "clamped=%d/%d (%.1f%%) preQ_meanRGB=%.3f/%.3f/%.3f\r\n",
               cdbg.x0, cdbg.y0, cdbg.x1, cdbg.y1, cdbg.side,
               cdbg.roi_w, cdbg.roi_h,
               cdbg.taps_clamped, cdbg.taps,
               (cdbg.taps>0)?(100.f*(float)cdbg.taps_clamped/(float)cdbg.taps):0.f,
               cdbg.mean_r, cdbg.mean_g, cdbg.mean_b);
#endif
#if DBG_PRINT_IN_STATS
        /* Quick stats on quantized FR input to sanity-check quantization mode */
        const int cnt = FR_IN_W * FR_IN_H * 3;
#if FR_INPUT_IS_U8
        uint8_t mn = 255, mx = 0; long sum = 0;
        double sumR=0, sumG=0, sumB=0;
        for (int i=0;i<cnt;i+=3){
          uint8_t r=((uint8_t*)fr_in)[i+0], g=((uint8_t*)fr_in)[i+1], b=((uint8_t*)fr_in)[i+2];
          if (r<mn) mn=r; if (r>mx) mx=r; sum+=r; sumR+=r; sumG+=g; sumB+=b;
          if (g<mn) mn=g; if (g>mx) mx=g; sum+=g;
          if (b<mn) mn=b; if (b>mx) mx=b; sum+=b;
        }
        float mean = (float)sum / (float)cnt;
        float mr=(float)(sumR/(double)(cnt/3)), mg=(float)(sumG/(double)(cnt/3)), mb=(float)(sumB/(double)(cnt/3));
        printf("[FR][in] U8 stats: min=%u max=%u mean=%.1f  perC=%.1f/%.1f/%.1f (expect ~127 center)\r\n",
               (unsigned)mn, (unsigned)mx, mean, mr, mg, mb);
        if (mean < 80.f || mean > 175.f) {
          printf("[FR][SUSPECT] Input looks NOT centered near 127. If your FR tflite expects U8, ok; "
                 "if it expects I8, rebuild with -DFR_INPUT_IS_U8=0.\r\n");
        }
#else
        int8_t mn = 127, mx = -128; long sum = 0;
        double sumR=0, sumG=0, sumB=0;
        for (int i=0;i<cnt;i+=3){
          int8_t r=((int8_t*)fr_in)[i+0], g=((int8_t*)fr_in)[i+1], b=((int8_t*)fr_in)[i+2];
          if (r<mn) mn=r; if (r>mx) mx=r; sum+=r; sumR+=r; sumG+=g; sumB+=b;
          if (g<mn) mn=g; if (g>mx) mx=g; sum+=g;
          if (b<mn) mn=b; if (b>mx) mx=b; sum+=b;
        }
        float mean = (float)sum / (float)cnt;
        float mr=(float)(sumR/(double)(cnt/3)), mg=(float)(sumG/(double)(cnt/3)), mb=(float)(sumB/(double)(cnt/3));
        printf("[FR][in] I8 stats: min=%d max=%d mean=%.1f  perC=%.1f/%.1f/%.1f (expect ~0 center)\r\n",
               (int)mn, (int)mx, mean, mr, mg, mb);
        if (mean < -40.f || mean > 40.f) {
          printf("[FR][SUSPECT] Input looks far from 0. Your FR likely expects U8 (zp=127). "
                 "Rebuild with: -DFR_INPUT_IS_U8=1\r\n");
        }
#endif /* FR_INPUT_IS_U8 */
#endif /* DBG_PRINT_IN_STATS */
        last_dbg_ms = now;
      }

      /* Run FaceRec (serialized on NPU) */
      NPU_Lock(TAG_FR);
      uint32_t t0 = HAL_GetTick();
      FaceRec_Run_NoLock();
      uint32_t dt = HAL_GetTick() - t0;
      NPU_Unlock(TAG_FR);

      /* Cache: NPU -> CPU */
      DCACHE_Invalidate(fr_out, fr_out_len);

      /* Dequantize int8 embeddings → float; scale=1/128, zp=0 */
      float probe_f[FR_EMB_SIZE];
      const int probe_dim = (int)MIN(FR_EMB_SIZE, (int)(fr_out_len)); /* bytes==dims here */
      int out_min = 127, out_max = -128; long out_sum = 0;
      for (int i = 0; i < probe_dim; ++i) {
        int8_t q = fr_out[i];
        if (q < out_min) out_min = q;
        if (q > out_max) out_max = q;
        out_sum += q;
        probe_f[i] = (float)q * 0.0078125f;  /* 1/128 */
      }
      /* Debug: dump first 10 embedding floats */
      for (int i = 0; i < 10 && i < probe_dim; i++) {
        printf("[FR][vec] probe[%d] = %.4f\r\n", i, probe_f[i]);
      }

