muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Pipeline_FaceRecognition/facerecognition_imp.c
#if DBG_PRINT_OUT_STATS
      {
        float out_mean = (float)out_sum / (float)probe_dim;
        float nrm = l2_norm(probe_f, probe_dim);
        int nan_cnt=0; for(int i=0;i<probe_dim;i++){ if(!isfinite(probe_f[i])) nan_cnt++; }
        printf("[FR][out] I8 stats: min=%d max=%d mean=%.1f  L2=%.3f  NaN=%d\r\n",
               out_min, out_max, out_mean, nrm, nan_cnt);
      }
#endif

      /* Compare to reference set — keep Top-K for debug */
      int   best_i = -1;
      float best_s = -2.0f;

      int   top_idx[8];   float top_val[8];
      const int K = (FR_TOPK <= 8 ? FR_TOPK : 8);
      for (int k=0;k<K;k++){ top_idx[k] = -1; top_val[k] = -2.0f; }

      for (int i = 0; i < g_ref_set_count; ++i) {
        int dim = (probe_dim < g_ref_set[i].dim) ? probe_dim : g_ref_set[i].dim;
        if (dim <= 0) continue;
        float s = cosine_sim(probe_f, g_ref_set[i].data, dim);

        if (s > best_s) { best_s = s; best_i = i; }

        /* insert into small Top-K */
        for (int k=0;k<K;k++){
          if (s > top_val[k]) {
            for (int m=K-1; m>k; --m) { top_val[m]=top_val[m-1]; top_idx[m]=top_idx[m-1]; }
            top_val[k] = s; top_idx[k] = i; break;
          }
        }
      }

      const char *name = "Unknown";
      if (best_i >= 0 && g_ref_set[best_i].name && g_ref_set[best_i].name[0] && best_s >= MATCH_THR) {
        name = g_ref_set[best_i].name;
      }

      /* Self-consistency with previous embedding */
      if (have_prev) {
        float sself = cosine_sim(probe_f, prev_emb, probe_dim);
        printf("[FR][self] cos(prev)=%.3f\r\n", sself);
      }
      memcpy(prev_emb, probe_f, probe_dim*sizeof(float)); have_prev = 1;

      /* Log result + Top-K */
      printf("[FR] match: %s  cos=%.3f  (dt=%lums)\r\n", name, best_s, (unsigned long)dt);
#if DBG_PRINT_TOPK
      if (K > 0) {
        printf("[FR][Top%d] ", K);
        for (int k=0;k<K;k++){
          if (top_idx[k] >= 0) {
            const char* nm = (g_ref_set[top_idx[k]].name && g_ref_set[top_idx[k]].name[0]) ? g_ref_set[top_idx[k]].name : "?";
            printf("%s:%.2f%s", nm, top_val[k], (k+1<K && top_idx[k+1]>=0) ? " | " : "\r\n");
          }
        }
      }
#endif

      /* Update overlay */
      snprintf((char*)g_fr_overlay_label, sizeof(g_fr_overlay_label), "%s  %.2f", name, best_s);
    }

    /* -------- publish detection only (overlay text is global) -------- */
    BaseType_t lock = xSemaphoreTake(disp.lock, portMAX_DELAY);  assert(lock == pdTRUE);

    if (primary.have) {
      disp.info.nb_detect = 1;
      disp.info.detects[0] = primary.roi;
    } else {
      disp.info.nb_detect = 0;
    }

    /* Ensure tracker overlay OFF so only one box is drawn */
    disp.info.tracking_enabled = 0;
#ifdef TRACKER_MODULE
    disp.info.tboxes_valid_nb = 0;
#endif
    disp.info.pp_ms = nn_pp[1] - nn_pp[0];

    lock = xSemaphoreGive(disp.lock);  assert(lock == pdTRUE);

    bqueue_put_free(&nn_output_queue);
    xSemaphoreGive(disp.update);
  }
}
